Revit 2027 API
ParameterTypeId.BoundaryZRotationFixed Property
 "Z Rotation - Fixed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryZRotationFixed { get; }
Public Shared ReadOnly Property BoundaryZRotationFixed As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryZRotationFixed {
	ForgeTypeId^ get ();
}
static member BoundaryZRotationFixed : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace